app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Alfred Hitchcock' LIMIT 1
---
  def find_similar
    @movies = Movie.find_by_director(params[:director])