app/controllers/movies_controller.rb

  def find_similar
    @movies = Movie.find_by_id(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1